[ 
   {
      "id": 1,
      "name": "Skull",
      "fileName": "skull.png",
      "description": "The skull is anterior to the spinal column and is the bony structure that encases the brain. Its purpose is to protect the brain and allow attachments for the facial muscles. The two regions of the skull are the cranial and facial region. The cranial portion is the part of the skull that directly houses the brain and the facial portion includes the rest of the bones of the skull."
   },
   {
      "id": 2,
      "name": "Vertebrae",
      "fileName": "vertebrae.png",
      "description": "The vertebral column supports the body’s physical structure and nervous system, enabling movement and sensation. Pathology of the spine can lead to debilitating outcomes on quality of life. The vertebral column (spine) defines the animal subphylum Vertebra, or vertebrates, of the phylum Chordata. In humans, it is composed of 33 vertebrae that include 7 cervical, 12 thoracic, 5 lumbar, 5 sacral, and 4 coccygeal. Along with the skull, ribs, and sternum, these vertebrae make up the axial skeletal system."
   },
   {
      "id": 3,
      "name": "Ribs",
      "fileName": "ribs.png",
      "description": "The ribs are the bony framework of the thoracic cavity. Generally, there are twelve pairs of ribs. Each rib articulates posteriorly with two thoracic vertebrae; by the costovertebral joint. An exception to this rule is that the first rib articulates with the first thoracic vertebra only. The ribs can be classified as true, false, or floating ribs. True ribs are ribs that directly articulate with the sternum with their costal cartilages. The false ribs are the ribs that indirectly articulate with the sternum. The floating ribs are the ribs that do not articulate the sternum at all."
   },
   {
      "id": 4,
      "name": "Collarbone",
      "fileName": "clavicle.png",
      "description": "The clavicle is a sigmoid-shaped long bone with a convex surface along its medial end when observed from cephalad position. It serves as a connection between the axial and appendicular skeleton in conjunction with the scapula, and each of these structures forms the pectoral girdle.[1] Though not as large as other supporting structures in the body, clavicular attachments allow for significant function and range of motion of the upper extremity as well as protection of neurovascular structures posteriorly. Each part of this long bone has a purpose in regards to its attachments that affects the overall physiology of the pectoral girdle."
   },
   {
      "id": 5,
      "name": "Humerus",
      "fileName": "humerus.png",
      "description": "The humerus is the largest bone of the upper extremity and defines the human brachium (arm). It articulates proximally with the glenoid via the glenohumeral (GH) joint and distally with the radius and ulna at the elbow joint. The most proximal portion of the humerus is the head of the humerus, which forms a ball and socket joint with the glenoid cavity on the scapula.[1] Just inferior to the head of the humerus is the anatomical neck of the humerus, which divides the head of the humerus from the greater and lesser tubercles. The anatomical neck of the humerus is the residual epiphyseal plate. An intertubercular groove appears proximally, which demarcates the two tubercles vertically. Following the tubercles is the surgical neck of the humerus, a site commonly susceptible to fractures."
   },
   {
      "id": 6,
      "name": "Radius Ulna",
      "fileName": "radius_ulna.png",
      "description": "The radius is one of two long bones that make up the human antebrachium, the other bone being the ulna. The radius has three borders, three surfaces, and has a prismoid shape in which the base is broader than the anterior border. The radius articulates proximally at the elbow with the capitulum of the humerus and the radial notch of the ulna. It articulates at its distal end with the ulna at the ulnar notch and with the articular surfaces of the scaphoid and lunate carpal bones."
   },
   {
      "id": 7,
      "name": "Pelvis",
      "fileName": "pelvis.png",
      "description": "The pelvis is a sturdy, bony structure located at the base of the spine, forming a protective ring around the lower abdominal organs. It consists of the ilium, ischium, and pubis bones, which fuse to provide stability and support for the body. The pelvis plays a crucial role in bearing the body's weight and facilitating movements of the legs and hips."
   },
   {
      "id": 8,
      "name": "Femur",
      "fileName": "femur.png",
      "description": "The femur, also known as the thigh bone, is the longest and strongest bone in the human body. It connects the hip joint to the knee joint and is essential for both standing and walking. The femur's structure is well-suited to withstand the forces generated during weight-bearing activities."
   },
   {
      "id": 9,
      "name": "Patella",
      "fileName": "patella.png",
      "description": "The patella, commonly referred to as the kneecap, is a small, flat, and triangular bone located in front of the knee joint. It acts as a protective shield for the knee and plays a vital role in enhancing the mechanical efficiency of the quadriceps muscles, which are responsible for extending the leg."
   },
   {
      "id": 10,
      "name": "Tibia_Fibula",
      "fileName": "tibia_fibula.png",
      "description": "The tibia and fibula are two long bones in the lower leg. The tibia, also known as the shinbone, is the larger and weight-bearing bone, while the fibula is a thinner bone that runs alongside it. Together, they provide stability to the ankle joint and support the muscles involved in movements such as walking and running."
   },
   {
      "id": 11,
      "name": "Phalanges",
      "fileName": "phalanges.png",
      "description": "Phalanges are the small bones that make up the fingers and toes. They are responsible for the intricate movements of these extremities and are crucial for tasks that require dexterity and fine motor skills, such as typing, gripping, and playing musical instruments."
   },
   {
      "id": 12,
      "name": "Foot",
      "fileName": "foot.png",
      "description": "The foot is a complex anatomical structure comprising numerous bones, ligaments, and muscles that work together to support the body's weight and facilitate movement. The arches of the foot, including the longitudinal and transverse arches, provide shock absorption and stability. The foot is divided into three main parts: the hindfoot, midfoot, and forefoot, each with its specific bones and functions."
   }
]

